for x in range(289_123_456, 389_123_456 + 1):
    fs = {f for i in range(2, int(x ** 0.5) + 1) if x % i == 0 for f in (i, x // i)}
    if len(fs) == 3:
        print(x, fs)

# for x in range(289_123_456, 389_123_456 + 1):
#     fs = set()
#
#     for i in range(2, int(x ** 0.5) + 1):
#         if x % i == 0:
#             fs.add(i)
#             fs.add(x // i)
#             if len(fs) > 3:
#                 break
#
#     if len(fs) == 3:
#         print(x, fs)
#     if x % 100_000 == 0:
#         print("Проверили число", x, time.time() - start)

# BREAK:
# Проверили число 289200000 17.25063991546631
# Проверили число 289300000 22.793793201446533
# Проверили число 289400000 22.580902338027954

# Без BREAK:
# Проверили число 289200000 52.41107892990112
# Проверили число 289300000 68.60793375968933
