numbers = [int(v) for v in open("27-b.txt").read().splitlines()][1:]

sm = ln = 0
seen_rems = []  # множество напечатанных остатков

for x in numbers[::-1]:
    sm += x
    ln += 1
    if sm % 43 not in seen_rems:
        seen_rems.append(sm % 43)
        print(sm % 43, sm, ln, sep="\t")

"""
    ВАРИАНТЫ:
    12	12646011	24526
    38	2844860301	4555642
    
    18	117082697	227286
    32	2536831945	3958607
    
    37	425110249	824321
    13	2505893598	3898849
    
    41	744081071	1442153
    9	1533796507	2014520
    
    29	851227599	1649870
    21	1917121997	2757796
    
    7	2217861876	3340775
    
    
    
        
    6	1473781576	2857143
    1	744080257	1081626
    УДАЛЯЕМ: 2217861833 (количество удалённых — 3938769)
    
    7	2217861833	3701302
    справа ничего не трогаем
    УДАЛЯЕМ: 2217861833 (количество удалённых — 3701302)





    
    МИНИМАЛЬНЫЕ ОСТАТКИ С ЛЕВОЙ ЧАСТИ:
    39	1044820790	2025132
    35	1168427640	2264910
    42	1178002371	2283570
    1	1373768086	2663049
    5	1428146535	2768408
    
    
    
    МИНИМАЛЬНЫЕ ОСТАТКИ С ПРАВОЙ ЧАСТИ:
    
    2	1488160514	1925785
    6	1552444572	2050661
    8	1588174650	2119879
    11	1635504495	2211479
    15	1783939854	2499358
    7	2217861876	3340775
    
"""
